

module {
  func @main_graph(%arg0: tensor<1x3x227x227xf32>) -> tensor<1x3x225x225xf32> {
    %0 = "onnx.Constant"() {value = dense<[[[[-0.0983254164, -0.0260975808, 0.145347431], [-0.0253212303, -0.143179253, -0.131865114], [0.0502952486, -0.00690813362, 0.0565927923]], [[0.162066117, 0.086539194, -0.0963390917], [0.184796944, -0.00741302967, -0.0319047272], [0.0809939951, -0.0190268308, -0.0885710269]], [[0.0729943365, 0.0146265626, 0.0476865321], [-0.11621324, -0.0379966199, -7.044480e-02], [-0.0275961012, 0.0884243101, -0.0789020285]]], [[[0.0757116228, 0.0481371582, -0.0933532566], [-0.0543158352, -0.0770506262, -0.188853204], [0.0634071678, 0.0909409374, -0.172741741]], [[0.115860209, 0.109876081, 4.738660e-02], [0.139898285, -0.0417139083, 0.104559109], [0.146423891, 0.0927534252, -0.0756735205]], [[0.0896780342, 0.163251266, -0.0716997832], [0.0467976332, -0.127270162, -0.155636877], [-0.0702688769, -0.0877472087, -0.0621817857]]], [[[-0.117895514, 0.0958092958, 0.011084944], [0.160240009, -0.0197026581, -0.137586564], [-0.0867600217, -0.0423381329, -0.186912164]], [[-0.072341904, 0.0203911215, -0.101534314], [0.0867453963, 0.0209726095, -0.0245060176], [-0.055221349, -2.338560e-02, -0.131151944]], [[-0.153301537, -0.160455376, -0.146203354], [0.162456498, 0.0294398218, 0.0924567133], [-0.0162402242, -0.0541403145, 0.081994608]]]]> : tensor<3x3x3x3xf32>} : () -> tensor<3x3x3x3xf32>
    %1 = "onnx.Constant"() {value = dense<[0.0946490318, 0.178162292, 0.0395492762]> : tensor<3xf32>} : () -> tensor<3xf32>
    %2 = "onnx.Conv"(%arg0, %0, %1) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : i64, kernel_shape = [3, 3], pads = [0, 0, 0, 0], strides = [1, 1]} : (tensor<1x3x227x227xf32>, tensor<3x3x3x3xf32>, tensor<3xf32>) -> tensor<1x3x225x225xf32>
    return %2 : tensor<1x3x225x225xf32>
  }
  "onnx.EntryPoint"() {func = @main_graph, numInputs = -1 : i32, numOutputs = 1 : i32} : () -> ()
}